In [1]:
import pandas as pd
import numpy as np
from sklearn import linear_model

df = pd.read_csv('datarumah.csv')
df

   luas      harga
0   120  130000000
1   135  148000000
2   140  160000000
3   180  210000000
4   220  285000000

DATA PREPROCESSING
MERAPIKAN DATA, MENGISI DATA YANG HILANG

at untuk mengisi value (0), index ke=2, kolom kamar tidur
cell yang kosong diisi degan nilai 0 terlebih dahulu

In [2]:
df.at[2,'kamartidur']=0
df

   luas      harga  kamartidur
0   120  130000000         NaN
1   135  148000000         NaN
2   140  160000000         0.0
3   180  210000000         NaN
4   220  285000000         NaN

Mengganti nilai 0 menjadi NaN (Not A Number)

In [3]:
df.replace(0, np.nan, inplace=True)
df

   luas      harga  kamartidur
0   120  130000000         NaN
1   135  148000000         NaN
2   140  160000000         NaN
3   180  210000000         NaN
4   220  285000000         NaN

mencari nilai median dari kolom kamar tidur

In [4]:
df.kamartidur.median()

nan

membulatkan nilai kebawah

In [5]:
import math
nilai_median_kamartidur = math.floor(df.kamartidur.median())
nilai_median_kamartidur

ValueError: cannot convert float NaN to integer

fillna untuk mengganti Nan Value

In [ ]:
df.kamartidur.fillna(nilai_median_kamartidur)

menampilkan value yang baru ke dalam dataframe

In [ ]:
df.kamartidur = df.kamartidur.fillna(nilai_median_kamartidur)
df

Modul Regresi Linear

In [ ]:
reg = linear_model.LinearRegression()
reg.fit(df[['luas','kamartidur','kamarmandi']],df.harga)

Menampilkan nilai slope (jika dibutuhkan)

In [ ]:
reg.coef_

menampilkan nilai intersep (jika dibutuhkan)

In [ ]:
reg.intercept_

prediksi

In [ ]:
int(reg.predict([[245,7,7]]))

Pembuktian

In [ ]:
1492322.09737828*245+-1900749.06367041*7+4544943.82022472*7+-58148876.404494345